[{"id":"upgraded-site","dateYear":2021,"dateMonth":12,"dateDay":5,"author":"TC Team","title":"Upgraded Site","preview":"Hey everyone, long time no post, but we have some minor updates regarding the website.","markdown":"# Upgraded Site\n\nHey everyone, long time no post, but we have some minor updates regarding the website. As you might be able to tell, the site had some minor appearance updates. Mainly the 'News' section and that we have an 'About' and 'Download' page now.\n\nBut under-the-hood the site has completely been revamped. If you looked at the site's [GitHub repo before all the revamping](https://github.com/Voltstro-Studios/Team-Capture-Site/tree/dffedfbb99bed6aa537859114c3366b7f36c2ae4), you can see that the only files included are just the HTML, CSS and JS files, and thats because the site was directly done like that, no generator was used. However this made maintaining the site hard, as for example if you want to change or add a link in the NavBar, you got to manually do it for each page.\n\nBut now, we have re-done the site in [NodeJS](https://nodejs.org/en/) and [react-static](https://github.com/react-static/react-static). This will make maintaining the site WAY easier, and since the deployable version of the site is still static, it will still be lightweight like the old version.\n\nThe updates site also makes posting new blog posts easier as well, as we can now just write it in plain markdown (instead of HTML files) and have it converted for us.\n\nI do want to make a note, none of the developers on the project are front end developers, or even \"proper\" web devs, so we have no clue what we are doing, but it seems to function and look fine, so I guess we didn't fuck up too bad. If you know how to use NodeJS/npm/React, and see something fucked in the code, please don't be afraid to open a PR on the [site's repo](https://github.com/Voltstro-Studios/Team-Capture-Site).\n\nOh we also attached a license to site's code, about time. All of it is under the [MIT license](https://github.com/Voltstro-Studios/Team-Capture-Site/blob/master/LICENSE.md).\n\n## Game Updates\n\nWe still have been busy working on the game it self, and this site overhaul will tie into some future updates for the game. But currently we don't have anything to show off, but that will be in the next post!"},{"id":"teamcapture-website","dateYear":2021,"dateMonth":5,"dateDay":3,"author":"TC Team","title":"Team-Capture Website","preview":"Welcome to the Team-Capture website.","markdown":"![TC-Banner](/static/news/2021/05/03/tc-website/tc-banner.png)\n\n# Welcome to the Team-Capture website\n\nYea, thats right, we got off our asses, did some front end development and designed and built a website for Team-Capture. Is this just gonna turn into what happened with [Voltstro's blog](https://voltstro.dev/blog/) where there is a post once a year? Maybe... possibly.\n\nIf you view this site in-game, then you will see some other cool shit we added.\n\nAnyway, enjoy the site, its designed after Team-Capture's game UI theme, so it should look like you are at home, and I gotta say, it turned out better then what I was expecting. Turns out Bootstrap is pretty good...\n\nAlso I just realized that I gotta thing for launching sites near or in April."}]